Autodesk.Revit.DB.ElementCategoryFilter.CategoryId
The category id.
Since:
2011

Autodesk.Revit.DB.ElementCategoryFilter.#ctor(Autodesk.Revit.DB.BuiltInCategory,System.Boolean)
Constructs a new instance of a filter to match elements by category, with the option to match all elements which are not of the given category.
category:
The category to match.
inverted:
True if the filter should match all elements which are not of the given category.

Autodesk.Revit.DB.ElementCategoryFilter.#ctor(Autodesk.Revit.DB.BuiltInCategory)
Constructs a new instance of a filter to match elements by category.
category:
The category to match.

Autodesk.Revit.DB.ElementCategoryFilter.#ctor(Autodesk.Revit.DB.ElementId,System.Boolean)
Constructs a new instance of a filter to match elements by category, with the option to match all elements which are of the given category.
categoryId:
The category id to match.
inverted:
True if the filter should match all elements which are not of the given category.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The category was not valid for filtering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ElementCategoryFilter.#ctor(Autodesk.Revit.DB.ElementId)
Constructs a new instance of a filter to match elements by category.
categoryId:
The category id to match.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The category was not valid for filtering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ElementCategoryFilter
A filter used to match elements by their category.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Since:
2011